### :white_check_mark: Terraform Plan (prd)

```
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNjQ4MTcyNC1kYzlmLTQ0ODUtODY3NC1kZGE3OGRiZWNhOTU7b2JqZWN0SWQ9MWM1NjI5M2EtODkyNS00NDE3LTg1ZTAtN2I0ZGY3ZTU1YWI1O3N1YnNjcmlwdGlvbklkPTUzOGYzY2JhLWQyZmItNDgyMC05YWYzLTkyZmNlOGRiOTE2OTt0ZW5hbnRJZD0zYjdmNGQ1YS0xYzFhLTRmOTAtYTc0OS02Nzc4M2U1ZjA2NzI=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_group.sql_admin[0] will be created
  + resource "azuread_group" "sql_admin" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "sql-admin-quote-prd-eus-01"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = false
      + mail_nickname                  = "sqladminquoteprdeus01"
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.app_service.azurerm_linux_web_app.this will be created
  + resource "azurerm_linux_web_app" "this" {
      + app_settings                                   = (known after apply)
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = "app-quote-prd-eus-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-quote-prd-eus-01"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = (known after apply)
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + logs {
          + detailed_error_messages = true
          + failed_request_tracing  = true

          + http_logs {
              + file_system {
                  + retention_in_days = 7
                  + retention_in_mb   = 100
                }
            }
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 5
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)
        }
    }

  # module.app_service.azurerm_monitor_diagnostic_setting.app_service will be created
  + resource "azurerm_monitor_diagnostic_setting" "app_service" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "diag-app-service"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "AppServiceAppLogs"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "AppServiceConsoleLogs"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "AppServiceHTTPLogs"
            # (1 unchanged attribute hidden)
        }

      + enabled_metric {
          + category = "AllMetrics"
        }
    }

  # module.app_service.azurerm_service_plan.this will be created
  + resource "azurerm_service_plan" "this" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "eastus"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "asp-quote-prd-eus-01"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "rg-quote-prd-eus-01"
      + sku_name                        = "P1v3"
      + tags                            = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }
      + worker_count                    = (known after apply)
    }

  # module.frontdoor.azurerm_cdn_frontdoor_endpoint.this will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "this" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "ep-quote-prd-eus-01"
    }

  # module.frontdoor.azurerm_cdn_frontdoor_firewall_policy.this will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "this" {
      + captcha_cookie_expiration_in_minutes      = 30
      + custom_block_response_status_code         = 403
      + enabled                                   = true
      + frontend_endpoint_ids                     = (known after apply)
      + id                                        = (known after apply)
      + js_challenge_cookie_expiration_in_minutes = 30
      + mode                                      = "Prevention"
      + name                                      = "wafquoteprdeus01"
      + request_body_check_enabled                = true
      + resource_group_name                       = "rg-quote-prd-eus-01"
      + sku_name                                  = "Premium_AzureFrontDoor"
      + tags                                      = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin.app will be created
  + resource "azurerm_cdn_frontdoor_origin" "app" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "origin-app-quote-prd-eus-01"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 1000
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin_group.this will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "this" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "og-quote-prd-eus-01"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + health_probe {
          + interval_in_seconds = 120
          + path                = "/"
          + protocol            = "Https"
          + request_type        = "HEAD"
        }

      + load_balancing {
          + additional_latency_in_milliseconds = 50
          + sample_size                        = 4
          + successful_samples_required        = 3
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_profile.this will be created
  + resource "azurerm_cdn_frontdoor_profile" "this" {
      + id                       = (known after apply)
      + name                     = "afd-quote-prd-eus-01"
      + resource_group_name      = "rg-quote-prd-eus-01"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Premium_AzureFrontDoor"
      + tags                     = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_route.this will be created
  + resource "azurerm_cdn_frontdoor_route" "this" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "HttpsOnly"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "route-quote-prd-eus-01"
      + patterns_to_match             = [
          + "/*",
        ]
      + supported_protocols           = [
          + "Https",
        ]
    }

  # module.frontdoor.azurerm_cdn_frontdoor_security_policy.this will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "this" {
      + cdn_frontdoor_profile_id = (known after apply)
      + id                       = (known after apply)
      + name                     = "sec-quote-prd-eus-01"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.frontdoor.azurerm_monitor_diagnostic_setting.frontdoor will be created
  + resource "azurerm_monitor_diagnostic_setting" "frontdoor" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "diag-frontdoor"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "FrontdoorAccessLog"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "FrontdoorHealthProbeLog"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "FrontdoorWebApplicationFirewallLog"
            # (1 unchanged attribute hidden)
        }

      + enabled_metric {
          + category = "AllMetrics"
        }
    }

  # module.monitoring.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "eastus"
      + name                                = "appi-quote-prd-eus-01"
      + resource_group_name                 = "rg-quote-prd-eus-01"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }
      + workspace_id                        = (known after apply)
    }

  # module.monitoring.azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "eastus"
      + name                            = "law-quote-prd-eus-01"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-quote-prd-eus-01"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }
      + workspace_id                    = (known after apply)
    }

  # module.network.azurerm_subnet.app_integration will be created
  + resource "azurerm_subnet" "app_integration" {
      + address_prefixes                              = [
          + "10.40.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-app-quote-prd-eus-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-quote-prd-eus-01"
      + virtual_network_name                          = "vnet-quote-prd-eus-01"

      + delegation {
          + name = "appservice-delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.network.azurerm_subnet.private_endpoint will be created
  + resource "azurerm_subnet" "private_endpoint" {
      + address_prefixes                              = [
          + "10.40.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-pe-quote-prd-eus-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-quote-prd-eus-01"
      + virtual_network_name                          = "vnet-quote-prd-eus-01"
    }

  # module.network.azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.40.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "eastus"
      + name                           = "vnet-quote-prd-eus-01"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-quote-prd-eus-01"
      + subnet                         = (known after apply)
      + tags                           = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }
    }

  # module.private_dns.azurerm_private_dns_zone.sql will be created
  + resource "azurerm_private_dns_zone" "sql" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.database.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-quote-prd-eus-01"
      + tags                                                  = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }
    }

  # module.private_dns.azurerm_private_dns_zone_virtual_network_link.sql will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "sql" {
      + id                    = (known after apply)
      + name                  = "link-sql-quote-prd-eus-01"
      + private_dns_zone_name = "privatelink.database.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-quote-prd-eus-01"
      + tags                  = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.resource_group.azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-quote-prd-eus-01"
      + tags     = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }
    }

  # module.sql.azurerm_monitor_diagnostic_setting.sql_server will be created
  + resource "azurerm_monitor_diagnostic_setting" "sql_server" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "diag-sql-server"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "AutomaticTuning"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "SQLSecurityAuditEvents"
            # (1 unchanged attribute hidden)
        }

      + enabled_metric {
          + category = "AllMetrics"
        }
    }

  # module.sql.azurerm_mssql_database.this will be created
  + resource "azurerm_mssql_database" "this" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = (known after apply)
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 64
      + min_capacity                                               = (known after apply)
      + name                                                       = "sqldb-quote-prd-eus-01"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "S1"
      + storage_account_type                                       = "Geo"
      + tags                                                       = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = false
    }

  # module.sql.azurerm_mssql_server.this will be created
  + resource "azurerm_mssql_server" "this" {
      + administrator_login                      = (sensitive value)
      + administrator_login_password             = (sensitive value)
      + connection_policy                        = "Default"
      + express_vulnerability_assessment_enabled = false
      + fully_qualified_domain_name              = (known after apply)
      + id                                       = (known after apply)
      + location                                 = "eastus"
      + minimum_tls_version                      = "1.2"
      + name                                     = "sql-quoteprdeus01"
      + outbound_network_restriction_enabled     = false
      + primary_user_assigned_identity_id        = (known after apply)
      + public_network_access_enabled            = false
      + resource_group_name                      = "rg-quote-prd-eus-01"
      + restorable_dropped_database_ids          = (known after apply)
      + tags                                     = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }
      + version                                  = "12.0"
    }

  # module.sql.azurerm_private_endpoint.sql will be created
  + resource "azurerm_private_endpoint" "sql" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "pep-sql-quote-prd-eus-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-quote-prd-eus-01"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "sql-private-dns-zone-group"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "psc-sql-quote-prd-eus-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sqlServer",
            ]
        }
    }

  # module.uami.azurerm_user_assigned_identity.this will be created
  + resource "azurerm_user_assigned_identity" "this" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "uami-quote-prd-eus-01"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-quote-prd-eus-01"
      + tags                = {
          + "app"                 = "quote"
          + "cost_center"         = "engineering"
          + "data_classification" = "critical-pii"
          + "environment"         = "prd"
          + "managed_by"          = "terraform"
          + "owner"               = "platform-team"
          + "region"              = "East US"
        }
      + tenant_id           = (known after apply)
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_service_default_hostname           = (known after apply)
  + app_service_identity_client_id         = (known after apply)
  + app_service_identity_principal_id      = (known after apply)
  + app_service_name                       = "app-quote-prd-eus-01"
  + application_insights_connection_string = (sensitive value)
  + frontdoor_endpoint_hostname            = (known after apply)
  + resource_group_name                    = "rg-quote-prd-eus-01"
  + sql_database_name                      = "sqldb-quote-prd-eus-01"
  + sql_server_fqdn                        = (known after apply)
  + sql_server_name                        = "sql-quoteprdeus01"

```